Revit 2027 API
BuiltInFailures.RebarFailures.CrankDoesntFitSegment Property
 Curves are too small to fit the Rebar Shape with Crank.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CrankDoesntFitSegment { get; }
Public Shared ReadOnly Property CrankDoesntFitSegment As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CrankDoesntFitSegment {
	FailureDefinitionId^ get ();
}
static member CrankDoesntFitSegment : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace